package me.jessyan.mvparms.graduation.mvp.model.entity;

import org.litepal.crud.DataSupport;

import java.util.List;

/**
 * 作者: 张少林 on 2017/4/10 0010.
 * 邮箱:1083065285@qq.com
 */

public class HotContentBean {

    /**
     * status : true
     * message : 成功
     * data : [{"id":"1","title":"才二十几岁，没必要对生活失去热情","Content":"每一颗年少的心里都曾装着一百种不一样的生活方式，我们总以为自己会撞上了与众不同的那一种。 却不知道其实世界上往往只有一种生活是真正关乎自己的，那就是\u201c自己的生活\u201d。 才二十几岁的模样，真的没必要对生活失去热情。 ﻿﻿这两天都会抽空余时间统计一下读者的留言，发现同龄人（也就是二十岁左右这个尴尬的年纪）给我提的提问最多，也最频繁，大家的问题六成以上都与迷茫沾了边。﻿﻿ ﻿有刚进入大学不久却不知道自己能干嘛的学弟学妹，有进入还不错的公司却做着自己不喜欢的工作想要离开的，也有想要去追求诗和远方却无力迈出第一步的。 还有快大学毕业却看不到未来过着十分迷茫的生活的。﻿ ﻿﻿我印象最深的是有一个女生，前两天辗转找到了我的微信。 她说她就像那些文章里写的那样，身处20岁这个尴尬的年纪，感觉什么都有，却一无所有。买不起好看的衣服和好用的化妆品，半年了没有走进过一次电影院，去年定下的旅行目标到现在都还没有实现，还有看不清身边的感情真伪\u2026\u2026 ﻿20出头的自己，又穷又迷茫又焦虑还没什么经验，感觉生活糟糕透了，真的担心30岁了会不会好起来。﻿ 20岁出头，就想着30岁会不会好起来？在我看来似乎有点不可理喻，可能用这个词有点夸张了。但30岁的生活品质不是由20岁的生活方式所决定的吗？ 所以，我对她说：我也没经历过30岁的生活会是什么样，但我相信20多岁时的生活方式，决定了你30岁的打开方式。 有时候我们会觉得自己对生活失去热情，对什么都得过且过，没有追求，这一切都可能是因为我们沉溺于安逸，沉溺于周末早上的热被窝，沉溺于自以为是的活法。 ﻿小艾是我的一个好朋友，21岁的姑娘，她觉得大学给不了自己想要的生活，大三不听别人的劝阻，毅然退学了。我记得那个时候我还一个劲的\u201c埋怨\u201d她：\u201c小艾啊，你怎么不申请休学，一下子就退学了呢，这样就等于没有希望了，是不是傻呀你？\u201d她只是咯咯的对着我傻笑，好在她的父母很尊重她的意见。 一开始，18个月里她换了7份工作，我以为她会一直这样没有目标的换下去，也为她感到有点可惜。没想到她前段时间突然就找我唠嗑说：\u201c大萌啊，我找到了一种壮游世界的方式了，好开心哟！\u201d 她如今在一家连锁酒店当服务员，这已经是她的第二个城市了，下个礼拜又该换第三个城市了。她说她要走遍中国每一个有这家酒店的城市，这样就可以旅行全中国了，看看祖国大好河山，也看看外面的大世界。 \u201c我倒感觉，这有点像酒店试睡员哎。\u201d \u201c我哪有这样的能力，只是普普通通的服务生而已啦，不过我和我们领导都说了好多次，好多想法才达成这样的结果的。\u201d小艾急忙和我解释。 她说她现在开始要学习外语，以后去国外也可以去酒店当服务生，这样就可以圆周游世界的梦想了。 我看得出来她很知足也很快乐，也许还是会有很多的不足。 ﻿\u201c没钱没时间，怎么去旅行？\u201d这是我被问的最多的问题。 我说没钱的话，那就平时没事的时候做一小份兼职嘛，互联网时代啥没有。然后也努力把你的爱好变成一个特长试试，会有人找你的。 还有，现在不是有很多旅行基金什么的嘛，好好规划一下路线去申请试试看。 我听到的回答大多数是这样的：\u201c算了算了，太麻烦了\u201d。 我们既觉得人生充满未知值得去探索，又深感世界一片虚无。﻿于是，我们用懒散遮掩追求，用忙碌解决空洞，用娱乐填补空虚。﻿ 我们即不想被世俗的成功学捆绑，也疲于去寻找内心的热情。 就像小艾一样，每一个人都有自己的壮游方式，﻿最重要的只是你自己你愿不愿意，有没有目标和想法，会不会坚持罢了。﻿﻿ ﻿﻿总有人问我：为什么我那么羡慕你的生活方式？也很希望自己有一天可以这样去生活。﻿ 后来，我想了很久为什么我们会不一样？也许人都各有所长，各有所短，你有的别人没有，别人有的你没有。没有的又想得到，所以才会这样吧。﻿ 你总是说你喜欢这个喜欢哪个，但我想说的是你为了你喜欢的东西付出了什么？ 最起码你能够每天为自己喜欢的事情早起一个小时吧，一年下来大概也就300个小时左右，足够你做好一件事情了。不说做好，你的爱好也该变成你的特长了啊。 我喜欢摄影，我在大学的时候，为了买单反做了好几份兼职；我曾经为了培养自己的视角，坚持每日一拍整整一年。 我你喜欢旅行，别人周末还在睡觉的时候我已经等着看日出了；我为了能够去西藏，光准备工作就走了半年。 我去穿越柴达木盆地遭遇血气胸做手术，徒步鳌太遇暴风雪差点失联过。 我可以不做月光族，为了我的旅行梦想；即使我在路上遇见了所有的悲伤，但我也依旧向往远方啊。 ﻿﻿没有人天生就该拥有什么或者得到什么。真的，你可以为你喜欢的事情每天都做点什么。 这样，也许有一天走着走着你就突然有方向了，你就对生活有了新的认识和热情。 二十岁，读起来就如春风般灿烂，你说你在怕什么？ 我想说的是：做一件事情，重要的不是身外之物是否完备，而是有没有决心，也没有必要什么事情都一切准备就绪才觉得可以去做什么。﻿﻿ ﻿﻿我以前也只会过一种生活，就是跟别人不一样。现在我知道了，大多数人都会选择的生活，才是值得的。 珍惜自己所拥有的，比起羡慕别人所拥有更为重要。 有时候，我们无法改变的是生活的轨迹，不可避免地趋于平淡和平凡。 但还好，我们才二十岁，没必要对生活失去热情。我们还可以选择给生命留下不一样的痕迹，避免变得平庸和麻木。 最后，无论你此刻是否迷茫，在阳光升起的时候，请相信，努力的人最终会得到回报。 "}]
     */

    private boolean status;
    private String message;
    private List<DataBean> data;

    public boolean isStatus() {
        return status;
    }

    public void setStatus(boolean status) {
        this.status = status;
    }

    public String getMessage() {
        return message;
    }

    public void setMessage(String message) {
        this.message = message;
    }

    public List<DataBean> getData() {
        return data;
    }

    public void setData(List<DataBean> data) {
        this.data = data;
    }

    public static class DataBean extends DataSupport{
        /**
         * id : 1
         * title : 才二十几岁，没必要对生活失去热情
         * Content : 每一颗年少的心里都曾装着一百种不一样的生活方式，我们总以为自己会撞上了与众不同的那一种。 却不知道其实世界上往往只有一种生活是真正关乎自己的，那就是“自己的生活”。 才二十几岁的模样，真的没必要对生活失去热情。 ﻿﻿这两天都会抽空余时间统计一下读者的留言，发现同龄人（也就是二十岁左右这个尴尬的年纪）给我提的提问最多，也最频繁，大家的问题六成以上都与迷茫沾了边。﻿﻿ ﻿有刚进入大学不久却不知道自己能干嘛的学弟学妹，有进入还不错的公司却做着自己不喜欢的工作想要离开的，也有想要去追求诗和远方却无力迈出第一步的。 还有快大学毕业却看不到未来过着十分迷茫的生活的。﻿ ﻿﻿我印象最深的是有一个女生，前两天辗转找到了我的微信。 她说她就像那些文章里写的那样，身处20岁这个尴尬的年纪，感觉什么都有，却一无所有。买不起好看的衣服和好用的化妆品，半年了没有走进过一次电影院，去年定下的旅行目标到现在都还没有实现，还有看不清身边的感情真伪…… ﻿20出头的自己，又穷又迷茫又焦虑还没什么经验，感觉生活糟糕透了，真的担心30岁了会不会好起来。﻿ 20岁出头，就想着30岁会不会好起来？在我看来似乎有点不可理喻，可能用这个词有点夸张了。但30岁的生活品质不是由20岁的生活方式所决定的吗？ 所以，我对她说：我也没经历过30岁的生活会是什么样，但我相信20多岁时的生活方式，决定了你30岁的打开方式。 有时候我们会觉得自己对生活失去热情，对什么都得过且过，没有追求，这一切都可能是因为我们沉溺于安逸，沉溺于周末早上的热被窝，沉溺于自以为是的活法。 ﻿小艾是我的一个好朋友，21岁的姑娘，她觉得大学给不了自己想要的生活，大三不听别人的劝阻，毅然退学了。我记得那个时候我还一个劲的“埋怨”她：“小艾啊，你怎么不申请休学，一下子就退学了呢，这样就等于没有希望了，是不是傻呀你？”她只是咯咯的对着我傻笑，好在她的父母很尊重她的意见。 一开始，18个月里她换了7份工作，我以为她会一直这样没有目标的换下去，也为她感到有点可惜。没想到她前段时间突然就找我唠嗑说：“大萌啊，我找到了一种壮游世界的方式了，好开心哟！” 她如今在一家连锁酒店当服务员，这已经是她的第二个城市了，下个礼拜又该换第三个城市了。她说她要走遍中国每一个有这家酒店的城市，这样就可以旅行全中国了，看看祖国大好河山，也看看外面的大世界。 “我倒感觉，这有点像酒店试睡员哎。” “我哪有这样的能力，只是普普通通的服务生而已啦，不过我和我们领导都说了好多次，好多想法才达成这样的结果的。”小艾急忙和我解释。 她说她现在开始要学习外语，以后去国外也可以去酒店当服务生，这样就可以圆周游世界的梦想了。 我看得出来她很知足也很快乐，也许还是会有很多的不足。 ﻿“没钱没时间，怎么去旅行？”这是我被问的最多的问题。 我说没钱的话，那就平时没事的时候做一小份兼职嘛，互联网时代啥没有。然后也努力把你的爱好变成一个特长试试，会有人找你的。 还有，现在不是有很多旅行基金什么的嘛，好好规划一下路线去申请试试看。 我听到的回答大多数是这样的：“算了算了，太麻烦了”。 我们既觉得人生充满未知值得去探索，又深感世界一片虚无。﻿于是，我们用懒散遮掩追求，用忙碌解决空洞，用娱乐填补空虚。﻿ 我们即不想被世俗的成功学捆绑，也疲于去寻找内心的热情。 就像小艾一样，每一个人都有自己的壮游方式，﻿最重要的只是你自己你愿不愿意，有没有目标和想法，会不会坚持罢了。﻿﻿ ﻿﻿总有人问我：为什么我那么羡慕你的生活方式？也很希望自己有一天可以这样去生活。﻿ 后来，我想了很久为什么我们会不一样？也许人都各有所长，各有所短，你有的别人没有，别人有的你没有。没有的又想得到，所以才会这样吧。﻿ 你总是说你喜欢这个喜欢哪个，但我想说的是你为了你喜欢的东西付出了什么？ 最起码你能够每天为自己喜欢的事情早起一个小时吧，一年下来大概也就300个小时左右，足够你做好一件事情了。不说做好，你的爱好也该变成你的特长了啊。 我喜欢摄影，我在大学的时候，为了买单反做了好几份兼职；我曾经为了培养自己的视角，坚持每日一拍整整一年。 我你喜欢旅行，别人周末还在睡觉的时候我已经等着看日出了；我为了能够去西藏，光准备工作就走了半年。 我去穿越柴达木盆地遭遇血气胸做手术，徒步鳌太遇暴风雪差点失联过。 我可以不做月光族，为了我的旅行梦想；即使我在路上遇见了所有的悲伤，但我也依旧向往远方啊。 ﻿﻿没有人天生就该拥有什么或者得到什么。真的，你可以为你喜欢的事情每天都做点什么。 这样，也许有一天走着走着你就突然有方向了，你就对生活有了新的认识和热情。 二十岁，读起来就如春风般灿烂，你说你在怕什么？ 我想说的是：做一件事情，重要的不是身外之物是否完备，而是有没有决心，也没有必要什么事情都一切准备就绪才觉得可以去做什么。﻿﻿ ﻿﻿我以前也只会过一种生活，就是跟别人不一样。现在我知道了，大多数人都会选择的生活，才是值得的。 珍惜自己所拥有的，比起羡慕别人所拥有更为重要。 有时候，我们无法改变的是生活的轨迹，不可避免地趋于平淡和平凡。 但还好，我们才二十岁，没必要对生活失去热情。我们还可以选择给生命留下不一样的痕迹，避免变得平庸和麻木。 最后，无论你此刻是否迷茫，在阳光升起的时候，请相信，努力的人最终会得到回报。
         */

        private String title;
        private String Content;

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getContent() {
            return Content;
        }

        public void setContent(String Content) {
            this.Content = Content;
        }
    }
}
